Revit 2015 API
SpaceTagTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual SpaceTagTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As SpaceTagTypeSetIterator
Visual C++
public:
virtual SpaceTagTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
SpaceTagTypeSet Class
Autodesk.Revit.DB.Mechanical Namespace